/*
 * MIT License
 *
 * Copyright (c) 2019 LandF Corporation
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

//________________________________________________________________________________________
//
//	UDS-CAN プロトコル処理
//
//----------------------------------------------------------------------------------------
//	開発履歴
//
//	2017/08/13	コーディング開始（橘）
//

	|					|	87	|	C7	|	Link Control								|	X	|
	+-------------------+-------+-------+-----------------------------------------------+-------+
	|	Data			|	22	|	62	|	Read Data By Identifier						|	O	|
	+	Transmission	+-------+-------+-----------------------------------------------+-------+
	|					|	23	|	63	|	Read Memory By Address						|	O	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	24	|	64	|	Read Scaling Data By Identifier				|	X	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	2A	|	6A	|	Read Data By Identifire Periodic			|	X	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	2C	|	6C	|	Dynamically Define Data Identifire			|	X	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	2E	|	6E	|	Write Data By Identifire					|	O	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	3D	|	7D	|	Write Memory By Address						|	O	|
	+-------------------+-------+-------+-----------------------------------------------+-------+
	|	Stored Data		|	14	|	54	|	Clear Diagnostic Information				|	X	|
	+	Transmission	+-------+-------+-----------------------------------------------+-------+
	|					|	19	|	59	|	Read DTC Information						|	X	|
	+-------------------+-------+-------+-----------------------------------------------+-------+
	|	I/O Control		|	2F	|	6F	|	Input Output Control By Identifire			|	X	|
	+-------------------+-------+-------+-----------------------------------------------+-------+
	|	Remote			|		|		|												|		|
	|	Activation of	|	31	|	71	|	Routine Control								|	X	|
	|	Routine			|		|		|												|		|
	+-------------------+-------+-------+-----------------------------------------------+-------+
	|	Upload /		|	34	|	74	|	Request Download							|	O	|
	+	Download		+-------+-------+-----------------------------------------------+-------+
	|					|	35	|	75	|	Request Upload								|	X	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	36	|	76	|	Transfer Data								|	O	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	37	|	77	|	Request Transfer Exit						|	O	|
	+					+-------+-------+-----------------------------------------------+-------+
	|					|	38	|	78	|	Request File Transfer						|	X	|
	+-------------------+-------+-------+-----------------------------------------------+-------+
*/
#if	0
//----------------------------------------------------------------------------------------
//	UDSパケット共用体定義
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//	Diagnostic and Communications Management
//----------------------------------------------------------------------------------------
//	ダイアグセッションコントロールサービス
typedef	struct	__uds_10_diagnostics_sec__
{
	unsigned char	SID;	//	0x10
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char		:	2;	//	未使用
			unsigned char	FC	:	6;	//	セッションコード 01:デフォルト / 02:プログラミング / 03:拡張ダイアグ
		}	BIT;
	}	SUB;
	unsigned char	DATA[UDS_BUFFER_MAX-2];
}	UDS_DIAG_SC;

//	リセットサービス
typedef	struct	__uds_11_ecu_reset__
{
	unsigned char	SID;	//	0x11
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char		:	2;	//	未使用
			unsigned char	FC	:	6;	//	セッションコード 01:ハード / 02:KeyOnOff / 03:ソフト / 04:高速シャットダウン許可 / 05:高速シャットダウン禁止
		}	BIT;
	}	SUB;
	unsigned char	DATA[UDS_BUFFER_MAX-2];
}	UDS_ECU_RES;

//	セキュリティーアクセスサービス
typedef	struct	__uds_27_security_access__
{
	unsigned char	SID;	//	0x27
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char		:	2;	//	未使用
			unsigned char	FC	:	6;	//	セッションコード 01:シード要求 / 02:Key送信 / 03～奇数:シード要求 / 04～偶数:Key送信
		}	BIT;
	}	SUB;
	unsigned char	DATA[UDS_BUFFER_MAX-2];
}	UDS_SEC_ACC;

//	コミュニケーションコントロールサービス
typedef	struct	__uds_28_communication_control__
{
	unsigned char	SID;	//	0x28
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char		:	2;	//	未使用
			unsigned char	FC	:	6;	//	セッションコード 00:送受信許可 / 01:受信許可 / 02:送信許可 / 03:送受信禁止
		}	BIT;
	}	SUB;
	unsigned char	CTYPE;	//	コミュニケーションタイプ 1:アプリケーション / 2:ネットワークマネージメント
	unsigned char	DATA[UDS_BUFFER_MAX-3];
}	UDS_COM_CNT;

//	テスタープレゼントサービス
typedef	struct	__uds_3e_tester_present__
{
	unsigned char	SID;	//	0x3E
	unsigned char	ZERO;	//	ゼロサブファンクション 0:固定
	unsigned char	DATA[UDS_BUFFER_MAX-2];
}	UDS_TES_PRE;

//----------------------------------------------------------------------------------------
//	Data Transmission
//----------------------------------------------------------------------------------------
//	共通識別子データ読み取りサービス
typedef	struct	__uds_22_read_data_ident__
{
	unsigned char	SID;	//	0x22
	unsigned char	RCIDHB;	//	レコードCID上位バイト
	unsigned char	RCIDLB;	//	レコードCID下位バイト
	unsigned char	TXM;	//	送信モード 01,02,03,04,05=single,slow,medium,fast,stop
	unsigned char	MNORTS;	//	応答電文最大長
	unsigned char	DATA[UDS_BUFFER_MAX];
}	UDS_RDB_IDE;
//	指定アドレス読み取りサービス
typedef	struct	__uds_23_read_memory_addr__
{
	unsigned char	SID;	//	0x23
	unsigned char	MEMAHB;		//	メモリアドレス上位
	unsigned char	MEMAMB;		//	メモリアドレス中位
	unsigned char	MEMALB;		//	メモリアドレス下位
	unsigned char	MEMSIZE;	//	メモリサイズ
	unsigned char	TXM;	//	送信モード 01,02,03,04,05=single,slow,medium,fast,stop
	unsigned char	MNORTS;	//	応答電文最大長
	unsigned char	DATA[UDS_BUFFER_MAX];
}	UDS_RDM_ADR;
//	共通識別子データ書き込みサービス
typedef	struct	__uds_2e_write_data_ident__
{
	unsigned char	SID;	//	0x2E
	unsigned char	RECCIDHB;	//	レコードCID上位バイト
	unsigned char	RECCIDLB;	//	レコードCID下位バイト
	unsigned char	DATA[UDS_BUFFER_MAX];	//	レコードデータ
}	UDS_WDB_IDE;
//	指定アドレス書き込みサービス
typedef	struct	__uds_3d_write_memory_addr__
{
	unsigned char	SID;	//	0x3D
	unsigned char	MEMAHB;		//	メモリアドレス上位
	unsigned char	MEMAMB;		//	メモリアドレス中位
	unsigned char	MEMALB;		//	メモリアドレス下位
	unsigned char	MEMSIZE;	//	メモリサイズ
	unsigned char	DATA[UDS_BUFFER_MAX];	//	書き込むデータ
}	UDS_WRM_ADR;

//----------------------------------------------------------------------------------------
//	Upload / Download
//----------------------------------------------------------------------------------------
//	ダウンロード要求（書式はメーカ固有）
typedef	struct	__uds_34_request_download__
{
	unsigned char	SID;	//	0x34
	unsigned char	CMP;	//	0x00	圧縮の方式指定	00＝無し
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char	ADDR	:	4;	//	アドレスバイト長
			unsigned char	SIZE	:	4;	//	サイズバイト長
		}	BIT;
	}	CONFIG;
	unsigned char	DATA[8];	//	アドレス情報、サイズ情報
}	UDS_REQ_DL;
//	ダウンロード応答（書式はメーカ固有）
typedef	struct	__uds_74_response_download__
{
	unsigned char	SID;	//	0x74
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char	SIZE	:	4;	//	2 サイズバイト長
			unsigned char			:	4;	//	0
		}	BIT;
	}	CONFIG;
	unsigned char	TXBHB;		//	転送ブロックサイズ情報上位(0x00～0x0F)
	unsigned char	TXBLB;		//	転送ブロックサイズ情報下位(0x00～0xFF)
	unsigned char	DATA[8];	//
}	UDS_RES_DL;
//	アップロード要求（書式はメーカ固有）
typedef	struct	__uds_35_request_upload__
{
	unsigned char	SID;	//	0x35
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char	ADDR	:	4;
			unsigned char	SIZE	:	4;
		}	BIT;
	}	CONFIG;
	unsigned char	DATA[8];
}	UDS_REQ_UL;
//	アップロード応答（書式はメーカ固有）
typedef	struct	__uds_75_response_download__
{
	unsigned char	SID;	//	0x75
	union	{
		unsigned char	BYTE;
		struct	{
			unsigned char	SIZE	:	4;	//	2 サイズバイト長
			unsigned char			:	4;	//	0
		}	BIT;
	}	CONFIG;
	unsigned char	TXBHB;		//	転送ブロックサイズ情報上位(0x00～0x0F)
	unsigned char	TXBLB;		//	転送ブロックサイズ情報下位(0x00～0xFF)
	unsigned char	DATA[8];	//
}	UDS_RES_DL;
//	データ転送
typedef	struct	__uds_36_transfer_data__
{
	unsigned char	SID;	//	0x36
	unsigned char	DATA[UDS_BUFFER_MAX];
}	UDS_TR_DATA;
//	転送中断
typedef	struct	__uds_37_request_transfer_exit__
{
	unsigned char	SID;	//	0x37
	unsigned char	DATA[2];
}	UDS_REQ_EXT;

//----------------------------------------------------------------------------------------
//	コード定義
//----------------------------------------------------------------------------------------
#define		UDS_ERR_SID				0x7F		/*	エラーサービスID								*/
#define		UDS_RES_SID				0x40		/*	正常レスポンス加算ID							*/

//----------------------------------------------------------------------------------------
//	エラーレスポンスコード(SID=0x7Fに添付)
//----------------------------------------------------------------------------------------
#define		UDS_EC_NONE				0x00		/*	エラー無し														*/
#define		UDS_EC_GR				0x10		/*	一般拒否														*/
#define		UDS_EC_SNS				0x11		/*	サポートされていないサービス									*/
#define		UDS_EC_SFNS				0x12		/*	サブ機能はサポートされていません								*/
#define		UDS_EC_IML_IF			0x13		/*	不適切なメッセージの長さまたは無効な形式						*/
#define		UDS_EC_RTL				0x14		/*	応答が長すぎます												*/
#define		UDS_EC_BRR				0x21		/*	ビジーリピートリクエスト										*/
